modules/admin/controllers/FuncionalidadesController.php

	public function actionDelete($id, $cod_modulo)
	{
		$model = $this->findModel($id);

		$flag = 0;
		if ($model->rlcPerfisFuncionalidadesAcoes) {
			foreach ($model->rlcPerfisFuncionalidadesAcoes as $value) {
				if ($value->tabRestricoesUsuarios) {
					$flag = 1;
				}
			}
		}

		if ($flag == 1) {
			$this->session->setFlash('danger', 'Erro: Existem Restrições de Usuários vinculadas a esta Funcionalidade.');
		} else {

			RlcPerfisFuncionalidadesAcoesSearch::deleteAll('cod_funcionalidade_fk = ' . $id . '');
---
DELETE FROM "acesso"."tab_funcionalidades" WHERE "cod_funcionalidade"='189'
DELETE FROM "acesso"."rlc_perfis_funcionalidades_acoes" WHERE cod_funcionalidade_fk = 189