modules/admin/controllers/MenusController.php

DELETE FROM "acesso"."rlc_menus_perfis" WHERE "cod_menu_fk"='151'
---

					if (array_diff_assoc($arrayMenuPerfil, $lista) || array_diff_assoc($lista, $arrayMenuPerfil)) {

						RlcMenusPerfisSearch::deleteAll([ 'cod_menu_fk' => $model->cod_menu]);