modules/admin/controllers/UsuariosPerfisController.php

DELETE FROM "acesso"."rlc_usuarios_perfis" WHERE "cod_perfil_fk"='50'
---

					if (array_diff_assoc( $arrayUsuariosPerfil , $lista ) || array_diff_assoc( $lista , $arrayUsuariosPerfil )){

						RlcUsuariosPerfisSearch::deleteAll( [ 'cod_perfil_fk' => $model->cod_perfil_fk] );