modules/admin/views/atributos/index.php

						'class' => 'yii\grid\DataColumn',
						'label' => 'Itens',
						'value' => function ($model, $key) {
							return TabAtributosValores::find()
								->where(['fk_atributos_valores_atributos_id' => $key])
								->count();
---
SELECT COUNT(*) FROM "public"."tab_atributos_valores" WHERE "fk_atributos_valores_atributos_id"=1