modules/admin/models/TabAcoesQuery.php

SELECT * FROM "acesso"."tab_acoes" WHERE dte_exclusao is null
---
    public function all($db = null)
    {
        return parent::all($db);