modules/admin/models/TabModulosQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM "acesso"."tab_modulos"

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM "acesso"."tab_modulos" WHERE txt_nome='Módulo administrativo'