modules/admin/models/TabPerfisQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM "acesso"."tab_perfis" WHERE dsc_perfil='Administrador Controle de Acesso'