modules/admin/models/TabUsuariosQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM "acesso"."tab_usuarios" WHERE (lower(txt_login)='administrador.ti' OR replace (replace (num_cpf, '-',''),'.','')='administradorti' OR replace (replace (replace (txt_login, '-',''),'.',''),'/','')='administrador.ti') AND txt_ativo='S'