models/TabAtributosQuery.php

SELECT * FROM "public"."tab_atributos"
---
    public function all($db = null)
    {
        return parent::all($db);